#current category: ['財經','心理學','程式','歷史',"人物","生活","職位",]
book_dict = {
"敏捷路上觀察紀錄-那些好用的與歪掉的部分":
"""
將domain story 轉化為user story，
以「身為”角色”,我”想要”,”這樣就可以”」
例如身為網頁使用者，我希望有個建議搜尋bar，這樣我就不用從頭找到尾

再者Agile開發需要注重的是需求者的核心，而不是像waterfall 的模式，預先設想使用者可能的使用，全面開發，可能導致系統龐大又只有少數核心被使用

而專案上常使用到的區分
Epic:專案的目標願景，通常花費數月
Feature:產品功能與特性，對user 價值的部分
Story: 功能的詳細描述，用來排交付順序，符合INVEST六大特點
Task: 團隊需完成的具體任務，由story 拆解而成
#程式
""",
"穿西裝的蛇":
"""
在導讀中就提到：在一段健康的關係裡有自省搭配調整通常會顯著改善兩人關係。但如果是不健康的關係，例如對方有高度精神病態的人格特質，你的努力通常是白費。以下幾個提醒可能會幫助1.精神病態是一種長期且穩定的人格特質，很難因為外在因素改變；調整自己因此希望對方改變通常不會有效果；2.「一直往自己身上咎責、找問題」的人，是精神病患喜歡的往來對象，因為在他們眼中你很容易操控
3.你不需要硬碰硬，而是熟悉平安相處、安全下莊的對應原則

精神變態者跟一般人差異在於動機，變態者只是為了達到目的，不在意他人是否受到傷害。他們是搞笑的掠奪者，因為他們不會良心不安，出現懷疑與擔憂

他們慣用的手法，研究》操縱〉拋棄，先判斷出哪些人是有利可圖的後去推敲心裡，讓對方感覺似乎認識知心好友般，在引導對方做出自己想要的事，一旦搾乾資源就會棄之不顧。因此這類人往往會受到兩極的評價，又或者在對上司跟下屬的態度大相逕庭。旁觀者也許認為這樣的人會在某個時間踢到鐵板，但實際上往往他們讓無辜受害者調離原本業務、自己升遷或是任職其他更高的企業

精神病態者的判斷，他們是體制破壞者，喜愛冒險，但具有冒險精神並不表示精神病態，深思熟慮考慮大局的冒險，是冒險家。
還有共情的困難，也會被「緊急狀態下處變不驚、控制情緒」誤解，後者是領導力的象徵

也因為精神病態者會觀察並操弄人性，記住當一件事好到不像真的，大概就不是真的，而精神變態者受害案例也有一些慣性：1.建立虛構誘惑，透過分析受害者建立出一套吸引的故事2.加強力道讓被害人與精神病態者連結3.同謀，很可能是受害者對病態者單方面的付出4.病態者更深操弄受害者周圍人，甚至可能讓受害者自我否定5.受虐升級，一旦提出質疑，病態者會加強力道，心裡、情緒以及肢體上6.洞察，當持續的矛盾不一的言行不同累積，受害者認知到自己旗子的角色7.克服羞愧，認知到自己是受害者沒必要感到羞愧8.憤怒與平凡，情緒的出口並想討回公道

劇透：劇情的最後也印證作者的描述，病態者往往可以拿到他想要的東西，但全書提供的不是職場工作守則，而是如何應對遇到職場中的病態者，對於作者一個主線故事搭配個別案例以及分析的方式，相當引人入勝。
#人物 #生活
""",
"越南美食史":
"""
在不同時代脈絡下，一件事情的好壞也是大相逕庭，嚼檳榔再現在已被認為是導致口腔癌等元兇。
但在越南的傳說，是因為三角戀，一男變成石頭，一位成為巨樹，女子成為藤蔓繫著樹，象徵愛與忠誠；因此反而是鼓勵大眾；而貴族也有食用檳榔，只是用的器材會是高級材料製成

不確定作者舉故事的意義，另一個故事描述魚露，也提到舉子的旅途乾糧有魚乾、海鮮醬、米、魚露等食物，為了避免丟臉，在食魚露時會用木魚沾食用，假造在吃魚的模樣，一旦中選，就丟棄木魚，或沒有就將木魚收起下次再用

牽一髮動全身，法國殖民越南，二戰開打，因為需要後勤，法國從越南吸資源、經濟作物跟稻米，導致越南內部稻米大漲，人民飢荒，導致越南鄉村開始反抗法國。
在反抗期間，因為炊煙容易被法國飛機發現，發明了地溝的無煙烹飪系統

整體來說這本書很有趣，引起去了解越南歷史的動機，因為在越南的歷史事件，在越南飲食激起或大或小的變動，經濟活動順應著當下狀態，人們也適應著或多或少的新口味
#生活
""",
    "刻意放鬆":
"""
如實察覺自己的情緒允許情緒浮現不否認不批評也不急著分析，就是讓情緒流動最重要的開始
活在當下：批評自己過去所做的決定對自己是不公平的，這忽略了過去當下我們往往以竭盡所能做到最好確定
超越結果才能讓生活更自在，專注過程活在當下
快樂是一種相對不快樂的狀態，本質就是短暫的，平靜才是帶來穩定的力量
""",
"最美五套質感人生穿搭":
"""
歐巴馬曾在訪問時表示：我只穿灰色或藍色西裝、我要試著減少選擇、因為我還有很多決策要做
趁換季整理衣服、固定頻率檢視衣服
現代的衣服被捨棄的時候大多狀況極佳，甚至連吊牌都在。
作者在最後給予讀者擦亮水晶球練習：
1.挑戰一個自己的習慣，讓自己不習慣，用不同於以往的方式處理他。
2.對直覺不喜歡的食物，先不要帶批判看他，而是試著了解他
3.好好的學習一件事不要計較有沒有用但持續可以學習

綜觀，作者身為時尚界的人，以及考量到這本書想要面對的讀者，因而強調省時間低管理高效的穿搭，雖然書中一開頭提到歐巴馬、Jobs穿衣思維，後續確是強調預測自己未來短期場合、定期購買/更換衣服，並且讓衣服去搭配人，不是穿出去他人稱讚的只是衣服。
其實Jobs等人的哲學應該是極簡，但相對於作者強調的是省時，還是相當不一樣的概念。
#生活
""",
"台灣茶第一堂課":
    """
    開頭很詳盡的介紹台灣主要茶種，比較有印象點是烏龍茶可以是茶品種也可以是烘培法，鐵觀音也同理，作者也強烈為冠軍茶比賽茶的追求而導致烏龍茶越趨一致性感到惋惜，台灣冠軍茶往往是抓住主品官的口味，要連連得獎甚至不難，加上需要看外觀，變成一場探究考官心理的考試，烏龍茶外觀越趨一致，為了柔球，嫩葉也更早採摘，還有人力成本上漲，採茶已經無法顧及天氣因素，請到人的那天就要趕緊採茶，不會特意挑晴天中午，茶葉最香時。
還有作者也詬病許多觀光區的"高山茶"往往是為了來宰肥羊，因此提供一些方法判斷，1.商家往往會濃茶短泡，這樣可以在茶葉澀味還沒出來時就給客人喝；應該要請店家淡茶久泡，好的茶葉耐泡，澀味也不會很重
#生活
    """,
"掃地出門":
"""
   作者田野調查，深入拖車營、貧民窟，跟當地居民打交道，也住在當地，透過生活跟訪談，頗析心裡後轉化成書中各個主角自己發生的角度，看完全書對於為何住進貧民窟後往往很難脫離有更深刻的理解，制度下被犧牲的人們，他們也努力，卻也很無奈，是本值得推薦的好書
   #人物 #生活
""",
"3年後你的工作還在嗎":
"""
MVP需要具有三種特質，這可以是一人兼具或是一個團隊具備：行腳商人，連結商品與市場需求、工匠：將商品從無到有製作、總管：凝聚團隊的核心

團隊的運作之道：民主與尊重大家意見，講白只是沒人想負責的同義詞，一個專案想要成功，程度上需要一個大家認可的強者出來主導，甚至有點專制，一個火車只有一個頭。

讀完全書基本脈絡在大人學podcast中都已經有說過了，持續磨練自己，拿自己當品牌，時刻去思考市場需要的是什麼，我能夠提供什麼價值，才是在市場持續下去的方法
#心理學 #生活
""",
"從MIT到中國製造":
"""
還沒有讀過作者在早期發表過的書籍，不過單就此書，作者身為一個美國人卻對於台灣歷史發生過的大小事一一串連，從1987年左右台灣中國經濟上曖昧模糊的合作、在跟其他外商相比，台商具有文化上的優勢，甚至是做事喜歡不透過政府的行為、中小企業為主帶來的機動性，都在早期為中國本身以及中台關係帶來顯著影響。
再來時間拉到更為近代2000年前後，樹上低的果實已經被栽的差不多，台灣除去大型企業外（富士康、旺中…），中小企業已經被中國企業迎頭趕上，加上中國的保護主義雪上加霜，被迫三轉（轉型、轉移、轉行）
另外中國本身的生產成本也在上漲，世界工廠的名稱已經開始不保（近期印度製造等）台灣跟中國想要靠以往的經濟合作關係以不大容易。
看此書像是進入一個時光機，從以前經濟崛起的台灣看到近代，相當精彩
#歷史 #生活
""",
"人體的故事":
"""
將食物煮熟或是斷筋可以有效提高消化效率，提高能量轉換比
舊石器時代中期的人們是厲害的狩獵者，可以獵殺各種大小獵物，而晚期的人們比較像美食家，小型食物或植物的食用比例增加，料理方式也增加，婦女小孩都能夠收集，這又大大增加能源的獲取
而狩獵時代進入農業時代，也帶來部分適配問題，當狩獵時，食物種類較多，牙齒狀況也較好；而農業時代因為大量依賴單一作物，不僅可能有營養問題還有受到氣候影響也較大，但好處是人均能夠採集的熱量是原先的五到六倍，能夠支撐更多人力，並且農業特性鼓勵。
作者以主要專注於人類個體跟當下生活環境的互動，去推論人體的從古至今的演化跟適應，可以提供不一樣的觀點讓人思考
#生活  #歷史
""",
"大人學破局思考":
"""
熱情=興趣*毅力*貢獻
熱情看的是為了某個人生成就而前進，不是今天上班辛不辛苦
興趣是火苗，需要持續的探索（毅力）跟跟其他人的互動、回饋（貢獻）

老闆不喜歡意外，員工該具有大局觀，辨識出應該提出的問題（不是雞毛蒜皮或是自己本身該做的事），趁早舉手，主動匯報，職場至看功勞不看苦勞

職場中職位越高，越多時間在溝通，那才是人類合作本質，完成老闆交代任務時，記得拆解並找出關鍵點，許多的時間都是用在釐清老闆的需求，這才是成敗關鍵（跟解題一樣，先理解算法才去寫程式）

工作不是等來的，而是證明你會之後，別人賦予的過程

在職場，可以預設自己某天一定會成為八卦的主角，甚至可以想：不招人嫉是庸才，乏人問津才是團體生活的恥辱

而對於八卦，保持有耳無嘴，培養讀空氣靈敏度，可以不說八卦，但不要排斥

關於能者過勞的想法，在於不影響健康的情況下（如果影響健康，該考慮的是時間的分配），要記得公司的機會、職缺才是最稀缺資源

時間管理背後的三個重點是：理解老闆想法、排出事情優先度、發揮減法思維
#生活 #心理學
""",
"無住之島":
"""
作者以順序說台灣的居住相關歷史，早在1990年代台灣有無殼蝸牛運動，原本是自發性對於高房價不滿的遊行，後來921發生後能量轉移又沈寂。2007附近，居住正義又被提起，當初的崔媽媽逐步找到核心，希望推動社宅，以租代買，讓人們有房住，又不會推升房價，無奈當時政府政策，補貼房租跟青年貸款補貼，都間接推升房價；實價登錄也在建商堅持下，變成為人詬病的門牌模糊跟不包含預售屋

而作者在總結的部分也分析到，從台灣早期住宅運動到巢運模式，逐步專業化，懂得借力使力，一個話題引爆點後還能夠與在野黨或執政黨合作繼續推動
但要對抗的利益團體也非常強大，不管是國民黨或民進黨上任，要對抗的團體差異不大。
#生活
""",
"你今天被騙了嗎":
"""
詐騙常依存在欲與懼，而喜好孤獨、不善社交者也有較高機率被騙
而對人信任也是一種詐騙手法，但信任也並非負面特質，而是對所有人無償的信任，容易讓人變成詐騙肥羊
金融詐騙，錨定效應，有時即時我們已經很小心，但人容易受到初始資訊的影響，即時後續資訊如何更新，想法都很難飄的太遠

對於自由意識的錯誤認知：我們的系統一很快，系統二反應慢但強調思考邏輯，詐騙集團會在我們自以為系統二的思考其實系統一的情況下，趁虛而入，例如恐懼、時間限制、慾望、貪財、維護自尊、挑戰等，激發我們的系統一，認識到我們的系統一是有bug，大腦具有理性跟非理性，才是對自由意識的新認識

不要過度自信跟不自信，自我肯定的權利包含：
不侵犯他人的權利，每個人都有權利選擇增加自己尊嚴跟自我尊重的行為方式
說不且不因此感到罪惡感的權利
有經驗和情感表達權利
行動前放慢步調和思考的權利
基於個人權益保護，有說不理由或不回應別人問題的權利
詐騙集團會盡可能忽視、剝奪我們這些權利已達到他們目標

自我肯定不是表示別人總要聽你的，而是能夠同時考慮到對方跟自己，表達出自己不一樣的想法、情緒、需求

過度自信/過度攻擊的一種表現像是諷刺對方，在表達自我權利的同時還傷害、貶低他人

其實全書的核心思想是固定的，就好像詐騙的核心思想也是固定，讓人相信，少查證，多信任，甚至於近期很多的線上課程宣傳手法都跟詐騙差異不大，主要也是因為這套手法有用，書本最後強調認識系統二的重要後更要善用，去查證你收到的訊息，是誰說的，背後資訊，才能夠更大程度較低風險。
#生活 #心理學
""",
"要不要生小孩":
"""
很諷刺的，在現代社會中，人們往往需要理由拒絕為何不生小孩，卻沒人問為何需要小孩
調查中，生小孩理由第一為生育小孩帶來的喜悅，第二多的是沒理由，自然發生
不生者對批評者說的：有些人說妳不生小孩真自私，但想想，生小孩是為了讓他們未來照顧你嗎？那還真自私

綜觀全書，即使是在今日，要寫支持不生育的書籍還是會有相當大的壓力，例如書中有份調查美國父母對於生育後感到後悔的比例，大約百分之九，但這沒有考慮到為人父母要承認後悔孩子也是需要相當勇氣，書中提供的想要孩子、考慮、不想要孩子跟對應實際情況，許多人有孩子也不是刻意之舉，而是單純意外或性趨力。 書中也介紹不同擁有孩子的預先準備，給想有孩子的人參考
#生活
""",
}
